/* Description for disconnection warning setting */
"1 Minute Alert Before Disconnection" = "نبهني قبل قطع الاتصال بدقيقة";

/* Error string for OTR message string */
"A private conversation could not be set up." = "لم نتمكن من إعداد المحادثة الخاصة.";

/* Title for the about page */
"About" = "عن البرنامج";

/* Label for button to show version numbers and licenses */
"About This Version" = "عن هذا الإصدار";

/* SSL error message */
"Access denied" = "الوصول مرفوض";

/* The string describing a buddy's account */
"Account" = "حساب";

/* Error title when account is disconnected */
"Account Disconnected" = "الحساب غير متصل";

/* Title for showing the users account otr fingerprints */
"Account Fingerprints" = "بصمات الحساب";

/* Title for the accounts tab */
"Accounts" = "الحسابات";

/* Button title to add someone as a buddy */
"Add" = "إضافة";

/* The title for the view to add a buddy */
"Add Buddy" = "إضافة صديق";

/* String to describe advanced set of settings */
"Advanced" = "متقدم";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "حدث خطأ أثناء تشفير الرسالة ولم يتم إرسالها.";

/* shown when changing database passphrase fails */
"An error occurred while changing the database passphrase." = "حدث خطأ أثناء تغيير قاعدة بيانات جملة السر.";

/* Error message when setting up database */
"An error occurred while setting up the database." = "حدث خطأ أثناء إعداد قاعدة البيانات.";

/* SSL error message */
"Attempt to restore an unknown session" = "محاولة استرداد جلسة مجهولة";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "مسح تلقائي";

/* string for title yes/no setting for allowing opportunistic otr */
"Auto-start Encryption" = "بدء التشفير تلقائيا";

/* Label in buddy list for users that are available */
"Available" = "متوفر";

/* Label in buddy list for users that are away */
"Away" = "بعيد";

/* Message displayed in Notification Manager when session will expire in one minute */
"Background session will expire in one minute." = "الجلسة الحالية ستنتهي خلال دقيقة.";

/* SSL error message */
"Bad certificate format" = "نسق الشهادة غير صحيح";

/* SSL error message */
"Bad MAC" = "MAC غير صحيح";

/* SSL error message */
"Bad protocol version" = "إصدار البروتوكول غير صحيح";

/* SSL error message */
"Bad SSLCipherSuite" = "SSLCipherSuite غير صحيح";

/* SSL error message */
"Bad unsupported cert format" = "نسق الشهادة غير المدعومة غير صحيح";

/* string to describe basic set of settings */
"Basic" = "مبتدأ";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "بما أن محتوى قاعدة البيانات مُعمَّى بواسطة جملتك السرية، فقد فقدت الوصول إلى البيانات ويجب عليك حذف وإعادة تثبيت ChatSecure لاستمرار. قد تنفعك برامج إدارة كلمات السر مثل 1Password وMiniKeePass لتوليد وحفظ كلمات سر متينة.";

/* The String for a button to block a buddy */
"Block" = "حظر";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "حظر و إزالة";

/* Title for showing the users buddies otr fingerprints */
"Buddy Fingerprints" = "بصمات الأصدقاء";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "معلومات الصديق";

/* Title for the buddy list tab */
"Buddy List" = "قائمة الأصدقاء";

/* Cancel an alert window */
"Cancel" = "إلغاء";

/* Shown when ending an encrypted chat session */
"Cancel Encrypted Chat" = "حذف المحادثة المُعمَّاة";

/* Error string for OTR message string */
"Cannot read the received message." = "لم يتمكن من قراءة الرسالة المتلقَّاة.";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "لم يتمكن من التعرف على نوع رسالة OTR المتلقَّاة.";

/* SSL error message */
"Cert chain not verified by root" = "لم يتحقق الجذر من سلسة الثقة";

/* SSL error message */
"Certificate expired" = "شهادة منتهية الصلاحية";

/* SSL error message */
"Certificate revoked" = "شهادة ملغاة";

/* SSL error message */
"Chain had a cert not yet valid" = "لا تتوفر سلسلة الثقة على شهادة غير صالحة بعد";

/* SSL error message */
"Chain had an expired cert" = "تتوفر سلسلة الثقة على شهادة منتهية الصلاحية";

/* Title for button to change encrypted database passphrase */
"Change Passphrase" = "تغيير جملة السر";

/* Title for chat view */
"Chat" = "المحادثة";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "تحدث معي بشكل آمن";

/* Title for chats view */
"Chats" = "المحادثات";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "تنبيهات ChatSecure";

/* let users know source is on Github */
"Check out the source here on Github" = "إطلع على الشفرة الأصلية للبرنامج هنا على Github";

/* SSL error message */
"Cipher Suite negotiation failure" = "فشل التفاوض حول أنظمة التعمية";

/* Label for text field where you compose a new message */
"Compose" = "كتابة";

/* SSL error message */
"Configuration error" = "خطأ في الإعدادات";

/* Button label for connecting a Facebook account */
"Connect Facebook" = "الاتصال بفيسبوك";

/* Label for button to create account by logging into an existing account */
"Connect to Existing Account" = "الاتصال بحساب مُسبَق";

/* Whether or not account is logged in */
"Connected" = "متصل";

/* String to state if an account is progress of creating a connection */
"Connecting" = "يجري الاتصال";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "الاتصال ب تُورْ";

/* SSL error message */
"Connection closed gracefully" = "قُطع الاتصال بلطف";

/* SSL error message */
"Connection closed via error" = "قُطع الاتصال بسبب خطأ";

/* Copy string to clipboard as in copy and paste */
"Copy" = "نسخ";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "لم يتمكن من جلب المفتاح العمومي من الشهادة";

/* Title for button to create account */
"Create" = "إنشاء";

/* Label for button to create a new account via in band registration */
"Create New Account" = "إنشاء حساب جديد";

/* Start of sentence that will be followed by names */
"Created by" = "أُنشِيء من طرف";

/* Title for progress of creating a new account */
"Creating Account" = "يجري إنشاء الحساب";

/* title label for the existing passphrase */
"Current Passphrase" = "جملة السر الحالية";

/* SSL error message */
"Decoding error" = "خطأ في فك الترميز";

/* SSL error message */
"Decompression failure" = "فشل في فك الضغط";

/* SSL error message */
"Decryption error" = "خطأ في فك التعمية";

/* SSL error message */
"Decryption failed" = "فَشِلَ فك التعمية";

/* SSL error message */
"Decryption failure" = "فشل فك التعمية";

/* default string to revert to normal language behaviour */
"Default" = "افتراضي";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "حذف الحساب ؟";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "احذف المحادثات عند الخروج";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "سُلِّم";

/* button label for disconnecting Facebook account */
"Disconnect Facebook" = "قطع الاتصال بفيسبوك";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "الرجاء عدم الإزعاج";

/* Error message when domain textfield left blank */
"Domain needs to be set" = "يجب تحديد النطاق";

/* Message when port is changed but domain not set */
"Domain needs to be set manually when specifying a custom port" = "يجب إعداد النطاق يدويا عند تحديد منفذ مخصص";

/* Title for donation link */
"Donate" = "تبرع";

/* Title for button to press when user is finished */
"Done" = "تم";

/* Error title when there is a duplicate account */
"Duplicate account" = "حساب مكرر";

/* The string describing account name or email address for a buddy */
"Email" = "البريد الالكتروني";

/* string for decription yes/no setting for allowing opportunistic otr */
"Enables opportunistic OTR" = "تمكين الاستفادة من تعمية OTR";

/* Generic title for encryption errors */
"Encryption Error" = "خطأ في التعمية";

/* title label for error when creating account */
"Error Creating Account" = "حدث خطأ خلال إنشاء الحساب";

/* Error message when registration fails */
"Error Registering Username" = "خطأ في تسجيل إسم المستخدم";

/* Title of error message pop-up box */
"Error!" = "خطأ!";

/* SSL error message */
"Export restriction" = "قيود التصدير";

/* Default message when a user status is set to extended away */
"Extended Away" = "بعيد جدا";

/* the name for facebook */
"Facebook" = "فيسبوك";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "فشل في الاتصال بخادم الاكس ام بي بي. تأكد من صحة بياناتك المدخلة واتصالك بالانترنت ثم حاول مجدداً.";

/* SSL error message */
"Fatal alert" = "تنبيه فادح";

/* your fingerprint */
"Fingerprint for you" = "بصمتك الرقمية";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "نسيت جملة السر ؟";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "جوجل توك";

/* SSL error message */
"Handshake failure" = "فشل قبضة اليد";

/* Label for button to open link to translate app */
"Help Translate" = "ساعدنا على الترجمة";

/* Label text for hostname field on login scree */
"Hostname" = "إسم النطاق";

/* SSL error message */
"I/O would block (not fatal)" = "قد يصدُّ الإدخال/الإخراج (ليس فادحا)";

/* SSL error message */
"Illegal parameter" = "مُعامِل غير مسموح به";

/* Short for information, button title to get more information */
"Info" = "المعلومات";

/* Shown when starting an encrypted chat session */
"Initiate Encrypted Chat" = "ابدأ محادثة مُعمَّاة";

/* SSL error message */
"Insufficient buffer provided" = "توفير صِوان غير كافٍ";

/* SSL error message */
"Insufficient security" = "أمان غير كافٍ";

/* SSL error message */
"Internal error" = "خطأ داخلي";

/* SSL error message */
"Invalid certificate chain" = "سلسلة الثقة غير صالحة";

/* title label for invalid email */
"Invalid Email" = "عنوان البريد الالكتروني غير صحيح";

/* Directions to the system software update */
"iOS Vulnerability" = "ثغرة iOS";

/* Message shown in line for users that are available */
"is now available" = "هو الآن متاح";

/* Message shown in line for users that are away */
"is now away" = "هو الآن بعيد";

/* Message shown in line for users that are offline */
"is now offline" = "هو الآن غير متصل";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "بروتوكول Jabber (XMPP)";

/* string to bring up language selector */
"Language" = "اللغة";

/* log in to account */
"Log In" = "تسجيل الدخول";

/* log out from account */
"Log Out" = "تسجيل الخروج";

/* shown during the login process */
"Logging in..." = "يجري تسجيل الدخول...";

/* Label for account setting that autologins on launch */
"Login Automatically" = "الدخول تلقائيا";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "إدارة حساب تنبيهات ChatSecure";

/* Subtitle lable for button to show saved fingerprints */
"Manage OTR fingerprints" = "إدارة بصمات OTR";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "إدارة شهادات SSL المحفوظة";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "لم تُرسَل الرسالة لأن صديقك أنهى المحادثة الخاصة. يلزمك إما قطع الاتصال أو إنعاشه.";

/* SSL error message */
"Miscellaneous bad certificate" = "شهادات سيئة متنوعة";

/* SSL error message */
"Module attach failure" = "فشل ربط الوحدة";

/* The string describing a buddy's display name */
"Name" = "الإسم";

/* For a new settings value */
"New" = "جديد";

/* Title for New Account View */
"New Account" = "حساب جديد";

/* title label for the new passphrase */
"New Passphrase" = "جملة سر جديدة";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "شهادة SSL جديدة";

/* Label for button to go to next step */
"Next" = "التالي";

/* SSL error message */
"No Error" = "لا يوجد خطأ";

/* SSL error message */
"No renegotiation allowed" = "المساومة غير مسموح بها";

/* To let the user know the fingerprint as not been checked */
"Not Verified" = "لم يُتحقق منه";

/* Label in buddy list for users that are offline */
"Offline" = "غير متصل";

/* Accept the dialog */
"OK" = "موافق";

/* For an old settings value */
"Old" = "قديم";

/* Message shown when using more than one Tor account with the same domain */
"Only one Tor account per domain is supported at this time." = "فقط حساب تُورْ واحد هو المدعوم هذه المرة.";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "افتح في كْرُومْ";

/* Label for button to open link in facebook app */
"Open in Facebook" = "افتح في فيسبوك";

/* Label for button to open link in twitter app */
"Open in Twitter" = "افتح في تويتر";

/* Hint text for domain field telling user this field is not required */
"Optional" = "اختياري";

/* the name for AIM */
"OSCAR Instant Messenger" = "مرسال OSCAR";

/* Title for other miscellaneous settings group */
"Other" = "أخرى";

/* Lable for button to show saved fingerprints */
"OTR Fingerprints" = "بصمات OTR";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "سياستنا تفرض علينا التعمية لكننا نحاول إرسال رسالة غير مُعمَّاة.";

/* Label text for password field on login screen */
"Password" = "كلمة السر";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "شهادة النظير صحيحة أو جرى تجاهلها لأن التحقق غير مفعَّل";

/* SSL error message */
"Peer dropped connection before responding" = "تخلى النظير عن الاتصال قبل الإجابة";

/* SSL error message */
"Peer host name mismatch" = "عدم تطابق إسم مضيف النظير";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "في انتظار الموافقة";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "حذف بشكل دائم";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "الشهادات المعلقة";

/* detail title label for invalid email */
"Please choose a valid email address" = "يُرجى اختيار عنوان صحيح للبريد الالكتروني";

/* Error description when account is disconnected while managing requests */
"Please log into this account before managing requests." = "يُرجى التسجيل في هذا الحساب قبل إدارة الطلبات.";

/* Label for port number field for connecting to service */
"Port" = "منفذ";

/* the alleged fingerprint of their other person */
"Purported fingerprint for" = "البصمة المزعومة لـ";

/* Title for push-messaging related settings */
"Push" = "تنبيهات";

/* Label for qr code image */
"QR code" = "رمز المربع";

/* Error string for OTR message string */
"Received a general OTR error." = "تلقَّى خطأ عاما ل OTR";

/* Error string for OTR message string */
"Received a heartbeat." = "تلقَّى نبضة.";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "تلقَّى رسالة مُعمَّاة لكن لم يتمكن من قراءتها لأنه لم يُقَم اتصال خاص بعد.";

/* Error string for OTR message string */
"Received an unencrypted message." = "تلقَّى رسالة غير مُعمَّاة.";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "تلقَّى وتجاهلَ رسالة كانت موجهة لطرف آخر.";

/* Error string for OTR message string */
"Received our own OTR messages." = "تلقَّى رسائلنا OTR.";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "السابق";

/* SSL error message */
"Record overflow" = "طوفان التسجيل";

/* Button title to reject a request such as a buddy request */
"Reject" = "رفض";

/* Label for switch to save passphrase */
"Remember Passphrase" = "تذكر جملة السر";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "تذكر إسم المستخدم";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "إزالة";

/* Reply to an incoming message */
"Reply" = "رد";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "مطلوب";

/* Label for text input for XMPP resource */
"Resource" = "المورد";

/* Title for button for saving a setting */
"Save" = "حفظ";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "الشهادات المحفوظة";

/* Label for text field where you search for a buddy */
"Search" = "البحث";

/* Title heading in settings */
"Security" = "الأمان";

/* Title of alert box warning about security issues */
"Security Warning" = "تحذير أمني";

/* string for settings to allow self signed SSL string */
"Self Signed SSL" = "شهادة SSL موقعة شخصيا";

/* String on button to email feedback */
"Send Feedback" = "إرسال مراجعة أو ملاحظات";

/* Error string for OTR message string */
"Sent a heartbeat." = "إرسال نبضة.";

/* SSL error message */
"Server closed session with no notification" = "أغلقَ الخادم الجلسة دون إشعار";

/* SSL error message */
"Server has requested a client cert" = "طلب الخادم شهادة الزبون";

/* Detail label for button to change encrypted database passphrase */
"Set new database passphrase" = "حدّد جملة سر قاعدة البيانات الجديدة";

/* Title for the Settings screen */
"Settings" = "الإعدادات";

/* Directions to the system software update */
"Settings -> General -> Software Update" = "الإعدادات -> عام -> تحديث البرنامج";

/* Title for sharing a link to the app */
"Share" = "شارك";

/* Title for setting about showing a warning before disconnection */
"Sign out Warning" = "تحذير تسجيل الخروج";

/* title label for signing up for a new account */
"Sign Up" = "تسجيل الدخول";

/* Label for button to skip this step */
"Skip" = "تخطى";

/* string for settings to allow SSL mismatch */
"SSL Hostname Mismatch" = "عدم تطابق إسم مضيف SSL";

/* SSL error message */
"SSL protocol error" = "خطأ في بروتوكول SSL";

/* Title of view where you can mange buddy or subscription requests */
"Subscription Requests" = "طلبات الاشتراك";

/* Title to let user know that encryption is not currently enabled */
"The conversation is not secure" = "المحادثة غير آمنة";

/* Title to let user know that the OTR fingerprint has not been checked */
"The conversation is secure and the fingerprint is verfied" = "المحادثة آمنة وتم التحقق من البصمة";

/* Warn user that the current chat is no longer secure */
"The conversation with %@ is no longer secure." = "المحادثة مع %@ لم تعد آمنة";

/* shown when changing database passphrase succeeds */
"The database passphrase change was successful." = "غُيِّرت جملة سر قاعدة البيانات بنجاح.";

/* Title to let user know that the OTR fingerprint has not been checked */
"The fingerprint has changed and needs to be verified" = "تغيرت البصمة ويجب التحقق منها";

/* Title to let user know that the OTR fingerprint has not been checked */
"The fingerprint has not been verified" = "لم يتم التحقق من البصمة";

/* Error string for OTR message string */
"The message received contains malformed data." = "تحوي الرسالة المتلقَّاة بيانات مشوَّهة.";

/* Error string for OTR message string */
"The previous message was resent." = "أُعيد إرسال الرسالة.";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "لا يدعم خادم XMPP التسجيل بنفس النطاق";

/* Error message when there is a duplicate account */
"There already exists an account with this username." = "يوجد مسبقا حساب بنفس إسم المستخدم هذا.";

/* Warns user that the current chat is secure */
"This chat is secured" = "هذه المحادثة آمنة";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "يبدو أن هذا الجهاز ليس مهيَّئا للقيام بالدفع.";

/* Instructions label text underneath QR code */
"This QR Code contains a link to http://omniqrcode.com/q/chatsecure and will redirect to the App Store." = "الرمز المربع هذا يحوي وصلة إلى http://omniqrcode.com/q/chatsecure وسيحولك إلى App Store.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "تُورْ ميزة تجريبية، يُرجى استخدامه بحذر.";

/* Name of the popular social tweeting site */
"Twitter" = "تويتر";

/* SSL error message */
"Underlying cryptographic error" = "خطأ ضمني في التعمية";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "تسجيلة DTLS غير متوقعة (متجاهَلة)";

/* SSL error message */
"Unexpected message received" = "التوصل برسالة غير مُنتظرَة";

/* SSL error message */
"Unknown Cert Authority" = "هيئة إصدار الشهادات مجهولة";

/* SSL error message */
"Unknown certificate" = "شهادة مجهولة";

/* Label for button to unlock app */
"Unlock" = "فك القفل";

/* SSL error message */
"User canceled" = "أُلغِي المستخدم";

/* Example of a username using the words user and example */
"user@example.com" = "user@example.com";

/* Label text for username field on login screen */
"Username" = "إسم المستخدم";

/* SSL error message */
"Valid cert chain, untrusted root" = "سلسلة الثقة صالحة، لكن الجذر غير موثوق به";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "الشهادة صحيحة";

/* To let the user know the fingerprint as been checked */
"Verified" = "مُتحقق منه";

/* Shown when verifying fingerprints */
"Verify" = "تحقق";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "تحقق من البصمة";

/* Shown when verifying fingerprints */
"Verify Later" = "تحقق لاحقا";

/* when displaying version numbers such as 1.0.0 */
"Version" = "الإصدار";

/* Warn user that the current chat is not secure */
"Warning: This chat is not encrypted" = "تحذير : هذه المحادثة غير مُعمَّاة";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "هل تريد الاتصال ب UserVoice لإرسال مراجعاتك أو ملاحظاتك ؟";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* Inform user that they must be secure their conversation before doing that action */
"You must be in a secure conversation first." = "يجب أن تكون في محادثة معماة أولا";

/* error message shown when user doesn't fill in a username or password */
"You must enter a username and a password to login." = "يجب أن تدخل إسم المستخدم وكلمة السر لتسجيل الدخول.";

/* Alert to system issues, leave in the %@ */
"Your current iOS system version (%@) contains a serious security vulnerability. Please update to the latest version as soon as possible." = "الإصدار الحالي (%@) لنظام iOS يحوي ثغرات أمنية خطيرة. يُرجى ترقية نظامك لآخر إصدار موجود في أقرب وقت ممكن.";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "يمكننا تبرعك من المساهمة في تطوير ChatSecure.";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "ستخزَّن كلمة سرك في مستودع مفاتيح iOS للجهاز فقط، وهو آمن بنفس مستوى أمن جملة سرك. لكن، لن تستمر بعد النسخ الاحتياطي أو الاستعادة بواسطة iTunes، لذا  يُرجى عدم نسيان ذلك، وإلا قد تضيع سجلات كل محادثاتك.";

